<a href="https://colab.research.google.com/github/dohyeon-kim012/python-1./blob/main/5.20_%EC%98%A4%EC%A0%84(pandas%20%EA%B8%B0%EC%B4%88).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
ls

sample_data/

In [3]:
pwd    # print workng directory 현재 위치 확인

'/content'

In [4]:
!whoami

root

In [5]:
%hist  # 작성했던 명령어들 보기

import pandas as pd
ls
pwd
!whoami
%hist

Linux 호출

In [7]:
import platform    # Linux 호출 함수
platform.platform()    # 내 컴퓨터 확인

'Linux-5.4.109+-x86_64-with-Ubuntu-18.04-bionic'

In [12]:
!nl /etc/issue.net    # 운영체제 확인

     1	Ubuntu 18.04.5 LTS

In [11]:
!nl /proc/cpuinfo

     1	processor	: 0
     2	vendor_id	: GenuineIntel
     3	cpu family	: 6
     4	model		: 79
     5	model name	: Intel(R) Xeon(R) CPU @ 2.20GHz
     6	stepping	: 0
     7	microcode	: 0x1
     8	cpu MHz		: 2199.998
     9	cache size	: 56320 KB
    10	physical id	: 0
    11	siblings	: 2
    12	core id		: 0
    13	cpu cores	: 1
    14	apicid		: 0
    15	initial apicid	: 0
    16	fpu		: yes
    17	fpu_exception	: yes
    18	cpuid level	: 13
    19	wp		: yes
    20	flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ss ht syscall nx pdpe1gb rdtscp lm constant_tsc rep_good nopl xtopology nonstop_tsc cpuid tsc_known_freq pni pclmulqdq ssse3 fma cx16 pcid sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm abm 3dnowprefetch invpcid_single ssbd ibrs ibpb stibp fsgsbase tsc_adjust bmi1 hle avx2 smep bmi2 erms invpcid rtm rdseed adx smap xsaveopt arat md_clear arch_capabilities
    21	bugs		: cpu_meltdown spectre_v1 spectre_v2 spec_store_bypass l1tf mds swapgs taa
    22	bogomips	: 4399.99
    23	clflush size	: 64
    24	cache_alignment	: 64
    25	address sizes	: 46 bits physical, 48 bits virtual
    26	power management:

    27	processor	: 1
    28	vendor_id	: GenuineIntel
    29	cpu family	: 6
    30	model		: 79
    31	model name	: Intel(R) Xeon(R) CPU @ 2.20GHz
    32	stepping	: 0
    33	microcode	: 0x1
    34	cpu MHz		: 2199.998
    35	cache size	: 56320 KB
    36	physical id	: 0
    37	siblings	: 2
    38	core id		: 0
    39	cpu cores	: 1
    40	apicid		: 1
    41	initial apicid	: 1
    42	fpu		: yes
    43	fpu_exception	: yes
    44	cpuid level	: 13
    45	wp		: yes
    46	flags		: fpu vme de pse tsc msr pae mce cx8 apic sep mtrr pge mca cmov pat pse36 clflush mmx fxsr sse sse2 ss ht syscall nx pdpe1gb rdtscp lm constant_tsc rep_good nopl xtopology nonstop_tsc cpuid tsc_known_freq pni pclmulqdq ssse3 fma cx16 pcid sse4_1 sse4_2 x2apic movbe popcnt aes xsave avx f16c rdrand hypervisor lahf_lm abm 3dnowprefetch invpcid_single ssbd ibrs ibpb stibp fsgsbase tsc_adjust bmi1 hle avx2 smep bmi2 erms invpcid rtm rdseed adx smap xsaveopt arat md_clear arch_capabilities
    47	bugs		: cpu_meltdown spectre_v1 spectre_v2 spec_store_bypass l1tf mds swapgs taa
    48	bogomips	: 4399.99
    49	clflush size	: 64
    50	cache_alignment	: 64
    51	address sizes	: 46 bits physical, 48 bits virtual
    52	power management:

In [13]:
!nl /proc/meminfo

     1	MemTotal:       13305332 kB
     2	MemFree:        10691272 kB
     3	MemAvailable:   12496524 kB
     4	Buffers:           88264 kB
     5	Cached:          1849272 kB
     6	SwapCached:            0 kB
     7	Active:           977888 kB
     8	Inactive:        1399920 kB
     9	Active(anon):     401176 kB
    10	Inactive(anon):      420 kB
    11	Active(file):     576712 kB
    12	Inactive(file):  1399500 kB
    13	Unevictable:           0 kB
    14	Mlocked:               0 kB
    15	SwapTotal:             0 kB
    16	SwapFree:              0 kB
    17	Dirty:               760 kB
    18	Writeback:             0 kB
    19	AnonPages:        440316 kB
    20	Mapped:           243064 kB
    21	Shmem:              1164 kB
    22	KReclaimable:     141020 kB
    23	Slab:             186976 kB
    24	SReclaimable:     141020 kB
    25	SUnreclaim:        45956 kB
    26	KernelStack:        4448 kB
    27	PageTables:         5800 kB
    28	NFS_Unstable:          0 kB
    29	Bounce:                0 kB
    30	WritebackTmp:          0 kB
    31	CommitLimit:     6652664 kB
    32	Committed_AS:    3222532 kB
    33	VmallocTotal:   34359738367 kB
    34	VmallocUsed:        6848 kB
    35	VmallocChunk:          0 kB
    36	Percpu:             1400 kB
    37	AnonHugePages:         0 kB
    38	ShmemHugePages:        0 kB
    39	ShmemPmdMapped:        0 kB
    40	FileHugePages:         0 kB
    41	FilePmdMapped:         0 kB
    42	HugePages_Total:       0
    43	HugePages_Free:        0
    44	HugePages_Rsvd:        0
    45	HugePages_Surp:        0
    46	Hugepagesize:       2048 kB
    47	Hugetlb:               0 kB
    48	DirectMap4k:       97480 kB
    49	DirectMap2M:     5144576 kB
    50	DirectMap1G:    10485760 kB

In [14]:
!df -h    # disk free - 파티션 확인 명령어
          # /dev/sda1: 하드디스크

Filesystem      Size  Used Avail Use% Mounted on
overlay         108G   39G   70G  36% /
tmpfs            64M     0   64M   0% /dev
tmpfs           6.4G     0  6.4G   0% /sys/fs/cgroup
shm             5.9G     0  5.9G   0% /dev/shm
tmpfs           6.4G   24K  6.4G   1% /var/colab
/dev/sda1       114G   41G   74G  36% /etc/hosts
tmpfs           6.4G     0  6.4G   0% /proc/acpi
tmpfs           6.4G     0  6.4G   0% /proc/scsi
tmpfs           6.4G     0  6.4G   0% /sys/firmware

mount 하기

In [15]:
from google.colab import drive  
drive.mount('/content/drive')

Mounted at /content/drive

In [16]:
!df -h    #/content/drive에 mount되었음

Filesystem      Size  Used Avail Use% Mounted on
overlay         108G   39G   70G  36% /
tmpfs            64M     0   64M   0% /dev
tmpfs           6.4G     0  6.4G   0% /sys/fs/cgroup
shm             5.9G     0  5.9G   0% /dev/shm
tmpfs           6.4G   24K  6.4G   1% /var/colab
/dev/sda1       114G   41G   74G  36% /etc/hosts
tmpfs           6.4G     0  6.4G   0% /proc/acpi
tmpfs           6.4G     0  6.4G   0% /proc/scsi
tmpfs           6.4G     0  6.4G   0% /sys/firmware
drive            15G  918M   15G   6% /content/drive

In [26]:
import pandas as pd
pd1 = pd.read_excel('/content/itx.xlsx')    #엑셀 파일 읽기
pd1

      google  45000
0   facebook  34000
1     oracle  39000
2  microsoft  43000
3   netfliex  56000

### colab 텍스트 서식 설정
**볼드**  __bold__ 
*기울기*  --취소선--  <u>밑줄</u>   
[구글](http://google.com)

In [23]:
!cat -n ss.txt   #txt 파일 넘버 붙여서 읽기

     1	이순신 85 87 90
     2	강감찬 75 80 95
     3	한석봉 99 98 99
     4	황진이 100 100 100
     5	안중근 90 85 90
     6	박문수 95 98 96
     7	임꺽정 15 35 45
     8	김정호 90 95 80
     9	정몽주 90 90 95
    10	김도현 50 45 60

In [24]:
!cat ss.txt

이순신 85 87 90
강감찬 75 80 95
한석봉 99 98 99
황진이 100 100 100
안중근 90 85 90
박문수 95 98 96
임꺽정 15 35 45
김정호 90 95 80
정몽주 90 90 95
김도현 50 45 60

In [38]:
d1 = pd.read_csv('/content/sss.txt')
d1

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 99 99 99
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  김도도 50 45 60

In [37]:
pd1 = pd.read_csv('/content/sc.csv')  
pd1

   이순신  85  87  90
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  99  99  99
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김도도  50  45  60

In [34]:
d2 = pd.read_csv('/content/ansi.csv', encoding = 'cp949')    # ANSI로 인코딩한 경우
d2

   이순신  85  87  90
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  99  99  99
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김도도  50  45  60

In [44]:
d3 = pd.read_excel('/content/se.xlsx', names=['이름', '국어', '영어', '수학'])
d3

    이름  국어  영어  수학
0  강감찬  75  80  95
1  한석봉  99  98  99
2  황진이  99  99  99
3  안중근  90  85  90
4  박문수  95  98  96
5  임꺽정  15  35  45
6  김정호  90  95  80
7  정몽주  90  90  95
8  김도도  50  45  60

In [45]:
d = d3.copy()
type(d)

pandas.core.frame.DataFrame

In [ ]:
dir(d)

In [47]:
d.shape , d.ndim , d.size , d.items

((9, 4), 2, 36, <bound method DataFrame.items of     이름  국어  영어  수학
 0  강감찬  75  80  95
 1  한석봉  99  98  99
 2  황진이  99  99  99
 3  안중근  90  85  90
 4  박문수  95  98  96
 5  임꺽정  15  35  45
 6  김정호  90  95  80
 7  정몽주  90  90  95
 8  김도도  50  45  60>)

In [50]:
d4 = pd.read_excel('/content/se.xlsx', header=None)
d4.columns=['이름', '국어', '영어', '수학']
d4

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  99  99  99
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  김도도  50  45  60

In [54]:
d = d4.copy()
d.head(3)

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99

In [53]:
d.tail(2)

    이름  국어  영어  수학
8  정몽주  90  90  95
9  김도도  50  45  60

In [55]:
d.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   이름      10 non-null     object
 1   국어      10 non-null     int64
 2   영어      10 non-null     int64
 3   수학      10 non-null     int64
dtypes: int64(3), object(1)
memory usage: 448.0+ bytes

In [57]:
d.describe()

              국어         영어        수학
count  10.000000  10.000000  10.00000
mean   78.800000  81.200000  84.90000
std    26.682495  22.714655  18.29663
min    15.000000  35.000000  45.00000
25%    77.500000  81.250000  82.50000
50%    90.000000  88.500000  92.50000
75%    93.750000  97.250000  95.75000
max    99.000000  99.000000  99.00000

In [58]:
d.index

RangeIndex(start=0, stop=10, step=1)

In [59]:
d.columns

Index(['이름', '국어', '영어', '수학'], dtype='object')

In [78]:
d[['이름','국어']]

    이름  국어
0  이순신  85
1  강감찬  75
2  한석봉  99
3  황진이  99
4  안중근  90
5  박문수  95
6  임꺽정  15
7  김정호  90
8  정몽주  90
9  김도도  50

In [67]:
d.loc[0]    # Index 값 넣으면 해당 값 불러와짐, column 값은 넣으면 안 됨

이름    이순신
국어     85
영어     87
수학     90
Name: 0, dtype: object

In [68]:
d.loc[3:6]

    이름  국어  영어  수학
3  황진이  99  99  99
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45

In [69]:
d[:]

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  99  99  99
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  김도도  50  45  60

In [71]:
d[ : :2]    # [start : end : step]

    이름  국어  영어  수학
0  이순신  85  87  90
2  한석봉  99  98  99
4  안중근  90  85  90
6  임꺽정  15  35  45
8  정몽주  90  90  95

In [79]:
d.loc[:,['수학','영어']]

   수학  영어
0  90  87
1  95  80
2  99  98
3  99  99
4  90  85
5  96  98
6  45  35
7  80  95
8  95  90
9  60  45

In [72]:
d.loc[2:3,['영어','수학']]    #index 2, 3 + '영어','수학' column의 값 뽑기

   영어  수학
2  98  99
3  99  99

In [73]:
d.loc[::-2]

    이름  국어  영어  수학
9  김도도  50  45  60
7  김정호  90  95  80
5  박문수  95  98  96
3  황진이  99  99  99
1  강감찬  75  80  95

In [81]:
d.loc[::2, ['이름','국어']]

    이름  국어
0  이순신  85
2  한석봉  99
4  안중근  90
6  임꺽정  15
8  정몽주  90

In [82]:
d.loc[3][2]

99